Repository: vadim-kotov/LinuxApplicationDevelopment2024
Catalog: 12_InstallPackaging/po/*.po
Languages: ru

source: Usage: %s [OPTION]
ru: Использование: %s [ПАРАМЕТР]

source: Interactive number guessing game.
ru: Интерактивная игра, угадывающая числа

source: Choose number between 1 and 100 and answer questions with only 'yes' or 'no'
ru: Загадайте число между 1 и 100 и отвечайте на вопросы только 'да' или 'нет'

source: Options:
ru: Параметры:

source: -r switch to Roman numerals
ru: -r переключить на Римские цифры

source: -h, --help show this help
ru: -h, --help показать эту справку

source: --version show version
ru: --version показать версию программы

source: Invalid
ru: Недопустимое число

source: Think of a number between 1 and 100
ru: Загадайте число от 1 до 100

source: Is your number bigger than
ru: Ваше число больше

source: ? (y/n):
ru: ? (д/н):

source: Input read error
ru: Ошибка чтения ввода

source: Input stopped by user
ru: Ввод остановлен пользователем

source: y
ru: д

source: n
ru: н

source: Please, type 'y'(yes) or 'n'(no).
ru: Пожалуйста, введите 'д'(да) или 'н'(нет)

source: Your number is:
ru: Ваше число:
